{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report confirming the YouTube button feature on File 5 is implemented in StoryPage.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, including notes on story content details and component responsibilities.",
  "frontend/index.css": "Global CSS defining light and dark theme CSS custom properties (OKLCH color tokens) for the Tailwind-based design system.",
  "frontend/index.html": "HTML entry point titled 'The EJ Files Countdown' that mounts the React app via a root div and module script.",
  "frontend/src/App.tsx": "Root React component managing navigation between a landing page, a 5-second loading screen, and five story pages using integer page state.",
  "frontend/src/components/CountdownTimer.tsx": "Empty file placeholder for the CountdownTimer component.",
  "frontend/src/components/StoryPage.tsx": "Story page component rendering classified file content with section cards, previous/next navigation, and a red YouTube CTA button that appears exclusively on page 5.",
  "frontend/src/data/storyContent.ts": "Defines the StoryContent interface and exports five story page objects narrating EJ's fictional classified history across events like the DiddyCoin venture and the Snow Bunny incident.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, recreating it when the Internet Identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useCountdown.ts": "Custom hook that initializes a 2-day-3-hour countdown target in localStorage (versioned key v2) and returns live time-remaining values updated every second.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file with no implementation, noting that countdown functionality is client-side only and requires no backend queries.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines a deep-space dark theme using OKLCH CSS custom properties with electric cyan accents.",
  "frontend/src/main.tsx": "React app entry point that mounts the app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based color tokens, custom fonts, border radii, glow box shadows, and animation keyframes.",
  "project_state.json": "Project state metadata describing 'The EJ Files Countdown' multi-file viewer, tracking existing features and a pending request to add a YouTube link button on file 5."
}